Revit 2027 API
ExternalServices.BuiltInExternalServices.ModelAccessValidationService Property
 The external service which validates the access to Revit model such as Revit Cloud model.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ModelAccessValidationService { get; }
Public Shared ReadOnly Property ModelAccessValidationService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ModelAccessValidationService {
	ExternalServiceId^ get ();
}
static member ModelAccessValidationService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace